#include <iostream>

// ((a-b)^3 - a^3) / (b^3 - 3*a*b^2 - 3*a^2*b), a = 1000, b = 0.0001

int main()
{
    double a, b, c, d, e, f, g, h, i, j, k, l;
    a = 1000.;
    b = 0.0001;

    // рассмотрим числитель
    c = a - b;          // вычитание переменных в скобке
    d = c * c * c;      // возведение первой скобки в куб
    e = a * a * a;      // возведение переменной в куб
    h = d - e;          // числитель

    // рассмотрим знаменатель
    f = b * b * b;      // возведение переменной в куб
    g = 3 * a * b * b;  // первое слагаемое
    i = 3 * a * a * b;  // второе слагаемое
    j = f - g;          // вычитание первого слагаемого из переменной
    k = j - i;          // знаменатель

    l = h / k;          // значение выражения

    std::cout << "double: " << std::fixed << l << std::endl;
    return 0;
}
